Tekla.Structures.Model.Grid
The Grid class defines a user defined (possibly magnetic) set of planes helping in modeling work. A grid has grid plane
instances as children.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Grid Grid = new Grid();
Grid.IsMagnetic = true;
bool Result = false;
Result = Grid.Insert();
}
}

Tekla.Structures.Model.Grid.CoordinateX
The coordinates for the X-axis.

Tekla.Structures.Model.Grid.CoordinateY
The coordinates for the Y-axis.

Tekla.Structures.Model.Grid.CoordinateZ
The coordinates for the Z-axis.

Tekla.Structures.Model.Grid.LabelX
The labels for the X-axis.

Tekla.Structures.Model.Grid.LabelY
The labels for the Y-axis.

Tekla.Structures.Model.Grid.LabelZ
The labels for the Z-axis.

Tekla.Structures.Model.Grid.ExtensionLeftX
The extension to the left X-axis.

Tekla.Structures.Model.Grid.ExtensionLeftY
The extension to the left Y-axis.

Tekla.Structures.Model.Grid.ExtensionLeftZ
The extension to the left Z-axis.

Tekla.Structures.Model.Grid.ExtensionRightX
The extension to the right X-axis.

Tekla.Structures.Model.Grid.ExtensionRightY
The extension to the right Y-axis.

Tekla.Structures.Model.Grid.ExtensionRightZ
The extension to the right Z-axis.

Tekla.Structures.Model.Grid.ExtensionForMagneticArea
The extension for the magnetic area.

Tekla.Structures.Model.Grid.Color
Gets or sets the color of the grid.

Tekla.Structures.Model.Grid.#ctor
Creates a new grid instance.
The default values are as follows:
Name = "Grid";
CoordinateX = "0.00 4*3000.00";
CoordinateY = "0.00 5*6000.00";
CoordinateZ = "0.00 6000.00 8000.00 9000.00";
LabelX = "A B C D E";
LabelY = "1 2 3 4 5 6";
LabelZ = "+0 +6000 +8000 +9000";
ExtensionLeftX = 2000.0;
ExtensionLeftY = 2000.0;
ExtensionLeftZ = 2000.0;
ExtensionRightX = 2000.0;
ExtensionRightY = 2000.0;
ExtensionRightZ = 2000.0;
IsMagnetic = false;

Tekla.Structures.Model.Grid.ToStruct(Tekla.Structures.ModelInternal.dotGrid_t@)
Converts the data of the grid to the struct data that is passed to Core
dotGrid: Struct to be filled